================================================================================
Comment form under cursor
================================================================================

(defn a|bc []
  ...)

--------------------------------------------------------------------------------

(defn #_a|bc []
  ...)

================================================================================
Comment form under cursor - left
================================================================================

(defn |abc []
  ...)

--------------------------------------------------------------------------------

(defn #_|abc []
  ...)

================================================================================
Comment form under cursor - right
================================================================================

(defn abc| []
  ...)

--------------------------------------------------------------------------------

(defn #_abc| []
  ...)

================================================================================
Comment form under cursor - space
================================================================================

(defn abc []
  (let [x | 1]
    ...))

--------------------------------------------------------------------------------

(defn abc []
  (let [#_x | 1]
    ...))

================================================================================
Comment form under cursor - nested left
================================================================================

(defn abc []
  |(let [x 1]
    ...))

--------------------------------------------------------------------------------

(defn abc []
  #_|(let [x 1]
    ...))

================================================================================
Comment form under cursor - nested right
================================================================================

(defn abc []
  (let [x 1]
    ...)|)

--------------------------------------------------------------------------------

(defn abc []
  #_(let [x 1]
    ...)|)

================================================================================
Comment form under cursor - touching left
================================================================================

(defn abc []
  (|let [x 1]
    ...))

--------------------------------------------------------------------------------

(defn abc []
  (#_|let [x 1]
    ...))

================================================================================
Comment form under cursor - touching middle
================================================================================

(defn abc []
  (l|et [x 1]
    ...))

--------------------------------------------------------------------------------

(defn abc []
  (#_l|et [x 1]
    ...))

================================================================================
Comment form under cursor - touching right
================================================================================

(defn abc []
  (let| [x 1]
    ...))

--------------------------------------------------------------------------------

(defn abc []
  (#_let| [x 1]
    ...))

================================================================================
Multi cursors
================================================================================

(defn abc []
  (let| [x |1
         |y 2]
    ...))

--------------------------------------------------------------------------------

(defn abc []
  (#_let| [x #_|1
         #_|y 2]
    ...))

================================================================================
Meta
================================================================================

(defn ^:smth a|bc []
  ...)

--------------------------------------------------------------------------------

(defn #_^:smth a|bc []
  ...)

================================================================================
Tagged
================================================================================

(def uuid
  #uuid "a|bc")

--------------------------------------------------------------------------------

(def uuid
  #_#uuid "a|bc")

================================================================================
Wrapped
================================================================================

(def wrap
  @*wra|p)

--------------------------------------------------------------------------------

(def wrap
  #_@*wra|p)

================================================================================
[ BROKEN ] Unbalanced
================================================================================

(defn abc []
  ...))|

--------------------------------------------------------------------------------

(defn abc []
  ...)#_)|

================================================================================
Empty Vector
================================================================================

[]|

--------------------------------------------------------------------------------

#_[]|

================================================================================
Reader conditional
================================================================================

(defn fun #?(:clj abc)| []
  ...)

--------------------------------------------------------------------------------

(defn fun #_#?(:clj abc)| []
  ...)

================================================================================
Selection
================================================================================

(def m
  {→:x 1←
   :y 2})

--------------------------------------------------------------------------------

(def m
  {#_→:x #_1←
   :y 2})

================================================================================
Selection 2
================================================================================

→(def m
  {:x 1
   :y 2})←

--------------------------------------------------------------------------------

#_→(def m
  {:x 1
   :y 2})←


================================================================================
Skip line comments
================================================================================

(def m
  {→:x 1
   ;; some comment
   :y 2 ;; another
   :z 3←})

--------------------------------------------------------------------------------

(def m
  {#_→:x #_1
   ;; some comment
   #_:y #_2 ;; another
   #_:z #_3←})
