================================================================================
Partial comment
================================================================================

(def m
  {→:x #_1
   #_:y 2←})

--------------------------------------------------------------------------------

(def m
  {#_→:x #_1
   #_:y #_2←})

================================================================================
Partial comment (reverse)
================================================================================

(def m
  {#_→:x #_1
   #_:y #_2←})

--------------------------------------------------------------------------------

(def m
  {→:x 1
   :y 2←})

================================================================================
[ BROKEN ] Uncomment line comments 1
================================================================================

(def m
  {:x 1
|   ;; :y 2
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
|   :y 2
   :z 3})

================================================================================
Uncomment line comments 2
================================================================================

(def m
  {:x 1
   |;; :y 2
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
   |:y 2
   :z 3})

================================================================================
Uncomment line comments 3
================================================================================

(def m
  {:x 1
   ;|; :y 2
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
   |:y 2
   :z 3})

================================================================================
Uncomment line comments 4
================================================================================

(def m
  {:x 1
   ;;| :y 2
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
   |:y 2
   :z 3})

================================================================================
Uncomment line comments 5
================================================================================

(def m
  {:x 1
   ;; |:y 2
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
   |:y 2
   :z 3})

================================================================================
Uncomment line comments 6
================================================================================

(def m
  {:x 1
   ;; :y |2
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
   :y |2
   :z 3})

================================================================================
Uncomment line comments 7
================================================================================

(def m
  {:x 1
   ;; :y 2|
   :z 3})

--------------------------------------------------------------------------------

(def m
  {:x 1
   :y 2|
   :z 3})

================================================================================
Uncomment with space 1
================================================================================

(defn |#_  abc []
  ...)

--------------------------------------------------------------------------------

(defn |abc []
  ...)

================================================================================
Uncomment with space 2
================================================================================

(defn #|_  abc []
  ...)

--------------------------------------------------------------------------------

(defn |abc []
  ...)

================================================================================
Uncomment with space 3
================================================================================

(defn #_|  abc []
  ...)

--------------------------------------------------------------------------------

(defn |abc []
  ...)

================================================================================
Uncomment with space 4
================================================================================

(defn #_ | abc []
  ...)

--------------------------------------------------------------------------------

(defn |abc []
  ...)

================================================================================
Uncomment with space 5
================================================================================

(defn #_  |abc []
  ...)

--------------------------------------------------------------------------------

(defn |abc []
  ...)

================================================================================
Uncomment with space 6
================================================================================

(defn #_  a|bc []
  ...)

--------------------------------------------------------------------------------

(defn a|bc []
  ...)

================================================================================
Uncomment with space 7
================================================================================

(defn #_  abc| []
  ...)

--------------------------------------------------------------------------------

(defn abc| []
  ...)

================================================================================
Uncomment with space 8
================================================================================

(defn #_  abc | []
  ...)

--------------------------------------------------------------------------------

(defn abc | []
  ...)

================================================================================
Uncomment deep 1
================================================================================

(defn |#_ (let [x 1
               y {:a [1 2 3]}])
  (println))

--------------------------------------------------------------------------------

(defn |(let [x 1
               y {:a [1 2 3]}])
  (println))

================================================================================
Uncomment deep 2
================================================================================

(defn #|_ (let [x 1
               y {:a [1 2 3]}])
  (println))

--------------------------------------------------------------------------------

(defn |(let [x 1
               y {:a [1 2 3]}])
  (println))

================================================================================
Uncomment deep 3
================================================================================

(defn #_| (let [x 1
               y {:a [1 2 3]}])
  (println))

--------------------------------------------------------------------------------

(defn |(let [x 1
               y {:a [1 2 3]}])
  (println))

================================================================================
Uncomment deep 4
================================================================================

(defn #_ |(let [x 1
               y {:a [1 2 3]}])
  (println))

--------------------------------------------------------------------------------

(defn |(let [x 1
               y {:a [1 2 3]}])
  (println))

================================================================================
Uncomment deep 5
================================================================================

(defn #_ (let [x 1
               y {:a [1| 2 3]}])
  (println))

--------------------------------------------------------------------------------

(defn (let [x 1
               y {:a [1| 2 3]}])
  (println))

================================================================================
Uncomment deep 6
================================================================================

(defn #_ (let [x 1
               y {:a [1 2 3]}]|)
  (println))

--------------------------------------------------------------------------------

(defn (let [x 1
               y {:a [1 2 3]}]|)
  (println))

================================================================================
Uncomment deep 7
================================================================================

(defn #_ (let [x 1
               y {:a [1 2 3]}])|
  (println))

--------------------------------------------------------------------------------

(defn (let [x 1
               y {:a [1 2 3]}])|
  (println))

